Conf.Simple/src/Enums/SUI_ПредопределенныеНастройкиПодсистемы/SUI_ПредопределенныеНастройкиПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ПредопределенныеНастройкиПодсистемы</name>
  <enumValues>
    <name>УправлениеТорговлей11</name>
  </enumValues>
  <enumValues>
    <name>УправлениеНашейФирмой</name>
  </enumValues>
  <enumValues>
    <name>Розница30</name>
  </enumValues>
  <enumValues>
    <name>Розница23</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_ШтрихкодыНоменклатурыКлиентСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды номенклатуры'");
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатуры() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11()
	
	Возврат "МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	|
	|МенеджерЗаписи.Штрихкод 		= Штрихкод;
	|МенеджерЗаписи.Номенклатура 	= Номенклатура;
	|МенеджерЗаписи.Характеристика 	= Характеристика;
	|МенеджерЗаписи.Упаковка 		= Упаковка;
	|
	|МенеджерЗаписи.Записать(Истина);";
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ()
	
	Возврат "МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	|
	|МенеджерЗаписи.Штрихкод 		= Штрихкод;
	|МенеджерЗаписи.Номенклатура 	= Номенклатура;
	|МенеджерЗаписи.Характеристика 	= Характеристика;
	|МенеджерЗаписи.ЕдиницаИзмерения = Упаковка;
	|
	|МенеджерЗаписи.Записать(Истина);";
	
КонецФункции

#КонецОбласти
